Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: "%d" format specifier (``"%" PRIdxx`` --- a cross-platform equivalent where ``xx`` can be ``8``, ``16``, ``32`` or ``64``, depending on the platform).
it_it: Specificatore di formato "%d" (``"%" PRIdxx`` --- un equivalente multipiattaforma dove ``xx`` può essere ``8``, ``16``, ``32`` o ``64``, a seconda della piattaforma).

source: "%f" format specifier, e.g. "%0.2f", to display two digits after the decimal point.
it_it: Specificatore di formato "%f", ad esempio "%0.2f", per visualizzare due cifre dopo la virgola.

source: "%s" to format the new pointer value as a string or "%p" to format the pointer as a pointer (typically the pointer's address value is spelled out with 4, 8 or 16 hexadecimal characters depending on the platform).
it_it: "%s" per formattare il nuovo valore del puntatore come stringa o "%p" per formattare il puntatore come puntatore (in genere il valore dell'indirizzo del puntatore è scritto con 4, 8 o 16 caratteri esadecimali a seconda della piattaforma).

source: "Available" in this context means that has been queued and assigned to a given Draw Unit and is ready to be carried out.
it_it: "Disponibile" in questo contesto significa che l'attività è stata messa in coda e assegnata a una determinata Draw Unit ed è pronta per essere eseguita.

source: "Common" MCUs like STM32F, STM32H, NXP Kinetis, LPC, iMX, dsPIC33, PIC32, SWM341 etc.
it_it: MCU "comuni" come STM32F, STM32H, NXP Kinetis, LPC, iMX, dsPIC33, PIC32, SWM341 ecc.

source: "HE" stands for "High Efficiency" while "HP" stands for "High Performance".
it_it: "HE" sta per "High Efficiency" mentre "HP" sta per "High Performance".

source: "Z:" is used to look up the driver for that file system in the list of all file-system drivers registered with LVGL.
it_it: "Z:" viene utilizzato per cercare il driver per quel file system nell'elenco di tutti i driver di file system registrati con LVGL.

source: "Z:/Users/me/wip/proposal.txt" (if the default drive is known to be C:)
it_it: "Z:/Users/me/wip/proposal.txt" (se l'unità predefinita è C:)

source: "cortex_m33_revC" works on all STM32 m33 devices with a NeoChrom core while "cortex_m33_NemaPVG" additionally supports the tessellation and matrix multiplication acceleration that the STM32 U5F and U5G NeoChrom cores are capable of.
it_it: "cortex_m33_revC" funziona su tutti i dispositivi STM32 m33 con un core NeoChrom, mentre "cortex_m33_NemaPVG" supporta inoltre l'accelerazione della tassellazione e della moltiplicazione di matrici di cui sono capaci i core STM32 U5F e U5G NeoChrom.

source: "custom" elements can have only arguments and no `type`, so they are pure setters.
it_it: Gli elementi "custom" possono avere solo argomenti e nessun `tipo`, quindi sono puri setter.

source: "libs/nema_gfx" contains pre-compiled binaries for the NeoChrom GPU drivers.
it_it: "libs/nema_gfx" contiene i binari precompilati per i driver GPU NeoChrom.

source: "src/draw/nxp/g2d/lv_draw_buf_g2d.c": draw buffer callbacks
it_it: "src/draw/nxp/g2d/lv_draw_buf_g2d.c": callback del buffer di disegno

source: "src/draw/nxp/g2d/lv_draw_g2d.c": draw unit initialization
it_it: "src/draw/nxp/g2d/lv_draw_g2d.c": inizializzazione dell'unità di disegno

source: "src/draw/nxp/g2d/lv_draw_g2d_buf_map.c": hash map for g2d buffers
it_it: "src/draw/nxp/g2d/lv_draw_g2d_buf_map.c": mappa hash per i buffer g2d

source: "src/draw/nxp/g2d/lv_draw_g2d_fill.c": fill area
it_it: "src/draw/nxp/g2d/lv_draw_g2d_fill.c": riempimento dell'area

source: "src/draw/nxp/g2d/lv_draw_g2d_img.c": blit image (w/ optional recolor or transformation)
it_it: "src/draw/nxp/g2d/lv_draw_g2d_img.c": immagine blit (con ricolorazione o trasformazione opzionale)

source: "src/draw/nxp/g2d/lv_g2d_utils.c": function helpers
it_it: "src/draw/nxp/g2d/lv_g2d_utils.c": helper delle funzioni

source: "src/draw/nxp/pxp/lv_draw_buf_pxp.c": draw buffer callbacks
it_it: "src/draw/nxp/pxp/lv_draw_buf_pxp.c": callback del buffer di disegno

source: "src/draw/nxp/pxp/lv_draw_pxp.c": draw unit initialization
it_it: "src/draw/nxp/pxp/lv_draw_pxp.c": inizializzazione dell'unità di disegno

source: "src/draw/nxp/pxp/lv_draw_pxp_fill.c": fill area
it_it: "src/draw/nxp/pxp/lv_draw_pxp_fill.c": area di riempimento

source: "src/draw/nxp/pxp/lv_draw_pxp_img.c": blit image (w/ optional recolor or transformation)
it_it: "src/draw/nxp/pxp/lv_draw_pxp_img.c": immagine blit (con ricolorazione o trasformazione opzionale)

source: "src/draw/nxp/pxp/lv_draw_pxp_layer.c": layer blending
it_it: "src/draw/nxp/pxp/lv_draw_pxp_layer.c": fusione dei livelli

source: "src/draw/nxp/pxp/lv_pxp_cfg.c": init, deinit, run/wait PXP device
it_it: "src/draw/nxp/pxp/lv_pxp_cfg.c": init, deinit, run/wait del dispositivo PXP

source: "src/draw/nxp/pxp/lv_pxp_osa.c": OS abstraction (FreeRTOS or bare metal)
it_it: "src/draw/nxp/pxp/lv_pxp_osa.c": astrazione del sistema operativo (FreeRTOS o "bare-metal")

source: "src/draw/nxp/pxp/lv_pxp_utils.c": function helpers
it_it: "src/draw/nxp/pxp/lv_pxp_utils.c": helper delle funzioni

source: "src/draw/nxp/vglite/lv_draw_buf_vglite.c": draw buffer callbacks
it_it: "src/draw/nxp/vglite/lv_draw_buf_vglite.c": callback del buffer di disegno

source: "src/draw/nxp/vglite/lv_draw_vglite.c": draw unit initialization
it_it: "src/draw/nxp/vglite/lv_draw_vglite.c": inizializzazione dell'unità di disegno

source: "src/draw/nxp/vglite/lv_draw_vglite_arc.c": draw arc
it_it: "src/draw/nxp/vglite/lv_draw_vglite_arc.c": disegno dell'arco

source: "src/draw/nxp/vglite/lv_draw_vglite_border.c": draw border
it_it: "src/draw/nxp/vglite/lv_draw_vglite_border.c": disegno del bordo

source: "src/draw/nxp/vglite/lv_draw_vglite_fill.c": fill area
it_it: "src/draw/nxp/vglite/lv_draw_vglite_fill.c": riempimento dell'area

source: "src/draw/nxp/vglite/lv_draw_vglite_img.c": blit image (w/ optional recolor or transformation)
it_it: "src/draw/nxp/vglite/lv_draw_vglite_img.c": immagine blit (con ricolorazione o trasformazione facoltativa)

source: "src/draw/nxp/vglite/lv_draw_vglite_label.c": draw label
it_it: "src/draw/nxp/vglite/lv_draw_vglite_label.c": disegno dell'etichetta

source: "src/draw/nxp/vglite/lv_draw_vglite_layer.c": layer blending
it_it: "src/draw/nxp/vglite/lv_draw_vglite_layer.c": fusione livelli

source: "src/draw/nxp/vglite/lv_draw_vglite_line.c": draw line
it_it: "src/draw/nxp/vglite/lv_draw_vglite_line.c": disegno linee

source: "src/draw/nxp/vglite/lv_draw_vglite_triangle.c": draw triangle
it_it: "src/draw/nxp/vglite/lv_draw_vglite_triangle.c": disegna triangoli

source: "src/draw/nxp/vglite/lv_vglite_buf.c": init/get vglite buffer
it_it: "src/draw/nxp/vglite/lv_vglite_buf.c": init/get buffer vglite

source: "src/draw/nxp/vglite/lv_vglite_matrix.c": set vglite matrix
it_it: "src/draw/nxp/vglite/lv_vglite_matrix.c": imposta la matrice vglite

source: "src/draw/nxp/vglite/lv_vglite_path.c": create vglite path data
it_it: "src/draw/nxp/vglite/lv_vglite_path.c": crea i dati del percorso vglite

source: "src/draw/nxp/vglite/lv_vglite_utils.c": function helpers
it_it: "src/draw/nxp/vglite/lv_vglite_utils.c": helper delle funzioni

source: # Python code here
it_it: # Qui il codice Python

source: #1 is covered below.
it_it: Il punto 1 è trattato di seguito.

source: #2 and #3 are covered in :ref:`draw_layers` and :ref:`display_screen_layers` respectively.
it_it: I punti 2 e 3 sono trattati rispettivamente in :ref:`draw_layers` e :ref:`display_screen_layers`.

source: (0,0) is the top-left corner of the image and can be set outside the image.
it_it: (0,0) è l'angolo in alto a sinistra dell'immagine e può essere impostato all'esterno dell'immagine.

source: (10 minutes)
it_it: (10 minuti)

source: (15 minutes)
it_it: (15 minuti)

source: (2-3 hours)
it_it: (2-3 ore)

source: (3 minutes)
it_it: (3 minuti)

source: (5 minutes)
it_it: (5 minuti)

source: (:cpp:expr:`lv_observer_get_target(observer)` can still be used if you need that pointer as a ``void *`` type for any reason, but in practice, this would be rare.)
it_it: (:cpp:expr:`lv_observer_get_target(observer)` può comunque essere utilizzato se si necessita di quel puntatore come tipo ``void *`` per qualsiasi motivo, ma nella pratica, è raro).

source: (A SCATTER chart also comes with a pre-allocated array of the same number of X-values.)
it_it: (Un grafico a dispersione include anche un array preassegnato dello stesso numero di valori X).

source: (All chart types use an array of Y-values.
it_it: (Tutti i tipi di grafico utilizzano un array di valori Y.

source: (Click on the "eye" icon to see the source file.)
it_it: (Cliccare sull'icona "occhio" per visualizzare il file sorgente).

source: (Default)
it_it: (Il default)

source: (Drawing of individual points on a SCATTER chart can be suppressed if their Y-values are set to :c:macro:`LV_CHART_POINT_NONE`.)
it_it: (Il disegno di singoli punti su un grafico a dispersione può essere soppresso se i loro valori Y sono impostati su :c:macro:`LV_CHART_POINT_NONE`).

source: (Focused state has higher precedence than default state).
it_it: (Lo stato "focused" ha una precedenza maggiore rispetto allo stato di default).

source: (If the display uses `LV_COLOR_FORMAT_I1`, LVGL automatically applies this rounding.
it_it: (Se il display utilizza `LV_COLOR_FORMAT_I1`, LVGL applica automaticamente questo arrotondamento.

source: (If they are only partially within the Scale's range, the Scale will only use that portion of the Section that overlaps the Scale's range.
it_it: (Se rientrano solo parzialmente nell'intervallo della "Scale", questa utilizzerà solo la porzione della Sezione che si sovrappone al suo intervallo.

source: (If you do not use selected text in your application, you can save 8 bytes per label in RAM by setting that macro to equate to ``0``.)
it_it: (Se non si utilizza testo selezionato nell'applicazione, è possibile risparmiare 8 byte per etichetta nella RAM impostando tale macro su ``0``.)

source: (It is ``1`` by default, and can be set to ``0`` to save some program space if you will not be using Observer.)
it_it: (È ``1`` per default e può essere impostato a ``0`` per risparmiare spazio nel programma se non si utilizza l'Observer).

source: (It's called align-items_ in CSS.)
it_it: (In CSS si chiama align-items_.)

source: (It's called justify-content_ in CSS.)
it_it: (In CSS si chiama justify-content_.)

source: (Means the same as :cpp:expr:`lv_pct()`.)
it_it: (Ha lo stesso significato di :cpp:expr:`lv_pct()`.)

source: (Not TTF or WOFF).
it_it: (Non TTF o WOFF).

source: (Not always available.)
it_it: (Non sempre disponibile).

source: (Note: this is done internally so you don't have to.)
it_it: (Nota: questa operazione viene eseguita internamente, quindi non è necessario farla).

source: (On a Windows machine you might need Virtual Box or WSL or MinGW or Cygwin etc.)
it_it: (Su una macchina Windows potrebbe essere necessario Virtual Box, WSL, MinGW, Cygwin, ecc.)

source: (Optional) Enable double-buffering:
it_it: (Facoltativo) Abilitare il doppio buffering:

source: (Pass ``false`` to hide them again.)
it_it: (Passare ``false`` per nasconderle di nuovo).

source: (Requires Node.js to be installed)
it_it: (Richiede l'installazione di Node.js)

source: (Same as ``int32_t`` in C.)
it_it: (Uguale a ``int32_t`` in C.)

source: (See :ref:`lvgl_and_threads`.)
it_it: (Vedere :ref:`lvgl_and_threads`.)

source: (See `Linking a pull request to an issue <https://docs.github.com/en/get-started/writing-on-github/working-with-advanced-formatting/using-keywords-in-issues-and-pull-requests#linking-a-pull-request-to-an-issue>`__ for details.)
it_it: (Per i dettagli, vedere `Linking a pull rquest to an issue <https://docs.github.com/en/get-started/writing-on-github/working-with-advanced-formatting/using-keywords-in-issues-and-pull-requests#linking-a-pull-request-to-an-issue>`__).

source: (See `Update modes`_ below.)
it_it: (Vedere le `Modalità di aggiornamento`_ di seguito.)

source: (See below.)
it_it: (Vedere di seguito).

source: (See definition above.)
it_it: (Vedere la definizione sopra).

source: (See later)
it_it: (Vedere più avanti).

source: (The latest version is recommended.)
it_it: (Si consiglia la versione più recente).

source: (This effect can be reversed by passing ``false`` instead.)
it_it: (Questo effetto può essere invertito passando ``false``.)

source: (This is normally done by reading the image header from the file and determining compatibility by reading the header content.)
it_it: (Questo viene normalmente fatto leggendo l'intestazione dell'immagine dal file e determinando la compatibilità leggendo il contenuto dell'intestazione).

source: (This is the default value.)
it_it: (Questo è il valore di default).

source: (This requires Python and https://github.com/lvgl/lv_font_conv/ to be installed.)
it_it: (Questo richiede l'installazione di Python e di https://github.com/lvgl/lv_font_conv/.)

source: (Use mouse wheel to zoom in, and drag image to pan it.)
it_it: (Usare la rotellina del mouse per ingrandire e trascinare l'immagine per spostarla).

source: (You need to add your VNC driver.)
it_it: (È necessario aggiungere il driver VNC).

source: (``<screen>``\ s don't support custom APIs.)
it_it: (Gli ``<screen>`` non supportano API personalizzate).

source: (``ta_label`` is a pointer to the Text Area's Label retrieved with ``ta_label = lv_textarea_get_label(textarea);``.)
it_it: (``ta_label`` è un puntatore all'etichetta della Text Area recuperata con ``ta_label = lv_textarea_get_label(textarea);``.)

source: (default)
it_it: (Il default).

source: (dependent on LV_X11_DIRECT_EXIT (can be 1 or 0))
it_it: (dipendente da LV_X11_DIRECT_EXIT (può essere 1 o 0))

source: (e.g. in main.c, LV_X11_DIRECT_EXIT must be 1):
it_it: (ad esempio, in main.c, LV_X11_DIRECT_EXIT dev'essere 1):

source: (in global memory or heap) are "logic packages", each containing the value being "observed" and its type (integer (``int32_t``), a string, a pointer, an :cpp:type:`lv_color_t`, a ``float``, or a group);
it_it: (nella memoria globale o heap) sono "pacchetti logici", ciascuno contenente il valore "osservato" e il suo tipo (intero (``int32_t``), una stringa, un puntatore, un :cpp:type:`lv_color_t`, un ``float``, o un gruppo);

source: (or adjust accordingly depending on how deep the file is nested).
it_it: (o modificare di conseguenza a seconda della profondità di nidificazione del file).

source: (zero or more per Subject, always dynamically-allocated) are always attached to exactly one Subject, and provide user-defined notifications each the time Subject's value changes.
it_it: (zero o più per Subject, sempre allocati dinamicamente) sono sempre associati a un solo Subject e forniscono notifiche definite dall'utente ogni volta che il valore del Subject cambia.

source: * Configs that need special handling when LVGL is used with Kconfig
it_it: * Configurazioni che richiedono una gestione speciale quando LVGL viene utilizzato con Kconfig

source: **.glb**: Binary format with all assets embedded in a single file
it_it: **.glb**: Formato binario con tutte le risorse incorporate in un singolo file

source: **.gltf**: JSON format with external binary and image files
it_it: **.gltf**: Formato JSON con file binari e di immagine esterni

source: **AI compatible** AI tools can read, generate, and refactor XML
it_it: **Compatibile con l'AI** gli strumenti di intelligenza artificiale possono leggere, generare e rifattorizzare XML

source: **ARM NEON Optimization**.
it_it: **Ottimizzazione ARM NEON**.

source: **Advanced usage: Use LVGL as local component**
it_it: **Uso avanzato: Utilizzare LVGL come componente locale**

source: **Alpha byte**: An alpha channel is added to every pixel that contains its opacity, typically a byte.
it_it: **Byte alpha**: Un canale alfa viene aggiunto a ogni pixel che ne contiene l'opacità, in genere un byte.

source: **Alpha indexed**: The values stored at pixel positions are alpha (opacity) values.
it_it: **Indicizzato alfa**: I valori memorizzati nelle posizioni dei pixel sono valori alfa (opacità).

source: **Ambient lighting** from all directions with proper color tinting
it_it: **Illuminazione ambientale** da tutte le direzioni con una corretta colorazione

source: **An XML Editor** with powerful autocomplete features to describe UI components, screens, tests, animations, data bindings, and many more.
it_it: **Un editor XML** con potenti funzionalità di auto-completamento per descrivere componenti dell'interfaccia utente, schermate, test, animazioni, data binding e molto altro.

source: **Animations** Create timeline-based animations and play them on button click.
it_it: **Animations** Crea animazioni basate sulla timeline e le riproduce al clic del pulsante.

source: **Animations**: Keyframe-based animations for nodes
it_it: **Animazioni**: Animazioni basate su keyframe per i nodi

source: **Area** (in some cases): Specifies where to draw.
it_it: **Area** (in alcuni casi): Specifica dove disegnare.

source: **Assets** Learn how to use images and fonts.
it_it: **Assets** Come usare immagini e font.

source: **Audio devices**: ``alsa://hw:0,0``, ``pulse://default``
it_it: **Dispositivi audio**: ``alsa://hw:0,0``, ``pulse://default``

source: **Audio**: AAC, MP3, Ogg Vorbis, FLAC, Opus, PCM, and others
it_it: **Audio**: AAC, MP3, Ogg Vorbis, FLAC, Opus, PCM e altri

source: **Automation ready** scripts and CI/CD can process XML effortlessly
it_it: **Automatizzabile** script e CI/CD possono elaborare XML senza sforzo

source: **Basic Setup Example**
it_it: **Esempio di Configurazione di Base**

source: **Be sure to carefully read the steps provided on that site or you will get an error while converting.**
it_it: **Assicurarsi di leggere attentamente i passaggi forniti su quel sito o si riceverà un errore durante la conversione**.

source: **Binary:** ``lved-cli.js`` (Node script) `Download CLI <https://github.com/lvgl/lvgl_editor/releases>`_
it_it: **Binari:** ``lved-cli.js`` (script Node) `Download CLI <https://github.com/lvgl/lvgl_editor/releases>`_

source: **Bitbake commands (Option 1)**
it_it: **Comandi Bitbake (Opzione 1)**

source: **Bitmap Masking for Images**: Using ``..._style_bitmap_mask`` or ``bitmap_mask`` in :cpp:type:`lv_draw_image_dsc_t` allows setting an A8 or L8 image as a mask for an image/layer during blending.
it_it: **Mascheramento Bitmap per Immagini**: Utilizzando ``..._style_bitmap_mask`` o ``bitmap_mask`` in :cpp:type:`lv_draw_image_dsc_t` è possibile impostare un'immagine A8 o L8 come maschera per un'immagine/layer durante il blending.

source: **Bitmap based**: 1, 2, 4 or 8-bpp and image format, and
it_it: **Bitmap based**: 1, 2, 4 o 8 bpp e formato immagine, e

source: **Build and flash**
it_it: **Build e flash**

source: **Buttons and Text**
it_it: **Pulsanti e Testo**

source: **CLI** (command-line interface) is a tool capable of validating the XML files and generating C code from them, or running the UI tests in CI/CD environments.
it_it: **CLI** (command-line interface) è uno strumento in grado di convalidare i file XML e generare codice C da essi, oppure di eseguire test dell'interfaccia utente in ambienti CI/CD.

source: **CMake Integration**
it_it: **Integrazione con CMake**

source: **CONFIG_LV_Z_DOUBLE_VDB**: Enables the use of two rendering buffers, allowing for parallel rendering and data flushing, thus improving responsiveness and reducing latency.
it_it: **CONFIG_LV_Z_DOUBLE_VDB**: Abilita l'utilizzo di due buffer di rendering, consentendo il rendering parallelo e il flushing dei dati, migliorando così la reattività e riducendo la latenza.

source: **CONFIG_LV_Z_FLUSH_THREAD**: Enables flushing LVGL frames in a separate thread, allowing the main thread to continue rendering the next frame simultaneously.
it_it: **CONFIG_LV_Z_FLUSH_THREAD**: Abilita il flushing dei frame LVGL in un thread separato, consentendo al thread principale di continuare a eseguire il rendering del frame successivo simultaneamente.

source: **CONFIG_LV_Z_FLUSH_THREAD_PRIO**: Sets the priority of the flush thread, with a default priority of 0, indicating cooperative priority.
it_it: **CONFIG_LV_Z_FLUSH_THREAD_PRIO**: Imposta la priorità del thread di flushing, con un valore predefinito di 0, che indica la priorità cooperativa.

source: **CONFIG_LV_Z_FLUSH_THREAD_STACK_SIZE**: Specifies the stack size for the flush thread, with a default of 1024 bytes.
it_it: **CONFIG_LV_Z_FLUSH_THREAD_STACK_SIZE**: Specifica la dimensione dello stack per il thread di flushing, con un valore di default di 1024 byte.

source: **CONFIG_LV_Z_VBD_CUSTOM_SECTION**: Allows rendering buffers to be placed in a custom memory section (e.g., `.lvgl_buf`), useful for leveraging specific memory types like tightly coupled or external memory to enhance performance.
it_it: **CONFIG_LV_Z_VBD_CUSTOM_SECTION**: Consente di posizionare i buffer di rendering in una sezione di memoria personalizzata (ad esempio, `.lvgl_buf`), utile per sfruttare tipi di memoria specifici come quella strettamente accoppiata o esterna per migliorare le prestazioni.

source: **CONFIG_LV_Z_VDB_ALIGN**: Ensures that the rendering buffer is properly aligned, which is critical for efficient memory access based on the color depth.
it_it: **CONFIG_LV_Z_VDB_ALIGN**: Garantisce che il buffer di rendering sia correttamente allineato, il che è fondamentale per un accesso efficiente alla memoria in base alla profondità del colore.

source: **CONFIG_LV_Z_VDB_SIZE**: Sets the rendering buffer size as a percentage of the display area, adjustable from 1% to 100%.
it_it: **CONFIG_LV_Z_VDB_SIZE**: Imposta la dimensione del buffer di rendering come percentuale dell'area di visualizzazione, regolabile dall'1% al 100%.

source: **Cameras**: Perspective and orthographic camera definitions
it_it: **Telecamere**: Definizioni di telecamere prospettiche e ortografiche

source: **Clip Corner Style Property**: Enabling ``..._style_clip_corner`` in a local or global style allows LVGL to create a layer for the top and bottom corner areas of a Widget.
it_it: **Proprietà Stile dell'Angolo di Ritaglio**: Abilitando ``..._style_clip_corner`` in uno stile locale o globale, LVGL crea un layer per le aree degli angoli superiore e inferiore di un Widget.

source: **Clip Radius of Images**: Similar to rectangles, images can also be rendered with a ``radius``.
it_it: **Raggio di Ritaglio delle Immagini**: Analogamente ai rettangoli, anche le immagini possono essere renderizzate con un ``raggio``.

source: **Code Running on Real Device**
it_it: **Codice in Esecuzione su Dispositivo Reale**

source: **Code**
it_it: **Codice**

source: **Compliant** - Apps are runnable as native Linux applications, which simplifies debugging and profiling.
it_it: **Conforme** - Le app sono eseguibili come applicazioni Linux native, semplificando il debug e la profilazione.

source: **Compliant** - Strives to be as compatible as possible with POSIX and Linux.
it_it: **Conforme** - Si impegna a essere il più compatibile possibile con POSIX e Linux.

source: **Consistent Build Environment**: The SDK ensures that developers are working with the same versions of and tools used in the Yocto build, which helps to avoid compatibility issues and ensures that applications will behave as expected on the target device.
it_it: **Ambiente di Build Coerente**: L'SDK garantisce che gli sviluppatori lavorino con le stesse versioni e gli stessi strumenti utilizzati nella build di Yocto, il che aiuta a evitare problemi di compatibilità e garantisce che le applicazioni si comportino come previsto sul dispositivo target.

source: **Constructor hook**: Called when the Widget and all its children are created.
it_it: **Hook del costruttore**: Viene richiamato quando vengono creati il Widget e tutti i suoi elementi figlio.
